app/controllers/bills_controller.rb

SELECT "bills".* FROM "bills"
SELECT SUM("bills"."amount") FROM "bills"
---
  def index
    @bills = Bill.all
    @total_submission = Bill.sum(:amount)

INSERT INTO "bills" ("amount", "bill_type", "employee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 1000], ["bill_type", 1], ["employee_id", "e404dfdf-4615-4049-b129-0a3fe8cb285d"], ["created_at", "2024-07-15 17:08:42.883687"], ["updated_at", "2024-07-15 17:08:42.883687"]]
---
  def create
    @bill = Bill.new(bill_params)

    respond_to do |format|
      if @bill.save

UPDATE "bills" SET "bill_type" = $1, "updated_at" = $2 WHERE "bills"."id" = $3  [["bill_type", 1], ["updated_at", "2024-07-15 11:21:01.801472"], ["id", "27fc63a3-ec99-46a6-9db4-444c8e425cc2"]]
---
  def update
    respond_to do |format|
      if @bill.update(bill_params)

DELETE FROM "bills" WHERE "bills"."id" = $1  [["id", "c8227de9-1d38-4168-919c-e1bf6982af30"]]
---
  def destroy
    @bill.destroy!

SELECT "employees".* FROM "employees"
---
    def set_collection
      @types = Bill.bill_types.keys
      @employees = Employee.all