app/controllers/employees_controller.rb

INSERT INTO "employees" ("first_name", "last_name", "email_address", "designation", "department_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "department_id" = $1, "updated_at" = $2 WHERE "employees"."id" = $3  [["department_id", "a07de8e6-26f6-4864-8eda-7f3490d058b9"], ["updated_at", "2024-07-15 16:55:55.688515"], ["id", "e404dfdf-4615-4049-b129-0a3fe8cb285d"]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)

DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", "e404dfdf-4615-4049-b129-0a3fe8cb285d"]]
---
  def destroy
    @employee.destroy!

SELECT "departments".* FROM "departments"
---
    def set_collection
     @departments = Department.all